import react from 'react';
import {View,Text,StyleSheet, ScrollView} from "react-native";
//import globalStyles from "./global-styles";

export default function TabAbout({navigation}) {
    
  return (
    //<View style={globalStyles.container}>
    <View style={styles.container}>
      <Text style={{fontSize:18}}>นกโดโดที่สูญพันธุ์ไปแล้ว อาจกลับมามีชีวิตอีกครั้ง</Text>
      <ScrollView contentContainerStyle={styles.scrollViewContent} 
      style={{alignItems: 'center'}} horizontal={false}>
        <Text style={styles.text}>
        จะเป็นอย่างไร ถ้าสัตว์ที่สูญพันธ์ุไปแล้วจะกลับมามีชีวิตอีกครั้ง? เมื่อนักวิทยาศาสตร์จากบริษัทตัดต่อยีน กำลังวางแผนคืนชีพให้นกโดโดที่สูญพันธุ์ไปตั้งแต่ปลายศตวรรษที่ 17 ให้มันกลับมาวิ่งเล่นบนโลกของเราอีกครั้ง 

นกโดโด (Dodo) เป็นนกที่มีรูปร่างประหลาด เพราะมันทั้งอ้วน ตัวใหญ่ และบินไม่ได้ ซึ่งนกโดโดอาศัยอยู่บนเกาะมอริเชียส (Mauritius) ในมหาสมุทรอินเดียจนถึงปลายศตวรรษที่ 17 หลังจากนั้นก็ไม่มีใครพบเห็นมันอีกเลย

สาเหตุหลักของการสูญพันธุ์ของนกโดโด คือการมาเยือนของกะลาสีเรือชาวตะวันตกที่ได้นำสิ่งมีชีวิตนักล่าต่างถิ่น เช่น หนู เข้ามาด้วย นอกจากนี้ ผู้คนเหล่านี้ยังออกล่าสัตว์ต่างๆ บนเกาะ ทำให้นกโดโดที่เป็นมิตรกับมนุษย์มาก ต้องสูญพันธุ์อย่างรวดเร็วภายในเวลาเพียงไม่กี่ทศวรรษ

แต่ด้วยความก้าวหน้าของโลกวิทยาศาสตร์ในยุคปัจจุบัน ทำให้เทคโนโลยีอย่าง การจัดลำดับดีเอ็นเอโบราณ การตัดต่อยีน และชีววิทยาสังเคราะห์ สามารถนำสิ่งมีชีวิตที่สูญพันธ์ุไปแล้วกลับมามีชีวิตอีกครั้ง 

“เห็นได้ชัดว่าในขณะนี้ เราอยู่ท่ามกลางวิกฤติการสูญพันธุ์ ซึ่งเราคิดว่าการนำเรื่องราวการปลุกชีพนกโดโดขึ้นมาพูด จะทำให้ผู้คนตระหนักถึงวิกฤตการสูญพันธุ์ที่เกิดขึ้นในโลกมากขึ้น” เบธ ชาปิโร (Beth Shapiro) ศาสตราจารย์ด้านนิเวศวิทยาและชีววิทยาวิวัฒนาการแห่งมหาวิทยาลัยแคลิฟอร์เนียกล่าว

นอกจากนี้ นักวิทยาศาสตร์ยังหวังว่าถ้าโครงการนี้สำเร็จ จะนำไปสู่การเกิดขึ้นของเทคนิคใหม่ๆ มากมาย ที่จะสามารถอนุรักษ์นกและสัตว์อื่นๆ ไม่ให้สูญพันธุ์หายไปจากโลกนี้ได้

โครงการปลุกชีพนกโดโด กำลังอยู่ในขั้นตอนการเปรียบเทียบข้อมูลทางพันธุกรรมกับนกที่ใกล้ชิดกับนกโดโดที่สุด ซึ่งก็คือสัตว์ตระกูลนกพิราบ ได้แก่ นกพิราบชาปีไหน (Nicobar Pigeon) และนกพิราบโรดริเกส โซลิแทร์ (Rodrigues Solitaire) วิธีดังกล่าวจะช่วยให้นักวิทยาศาสตร์ สามารถจำกัดการกลายพันธุ์ของข้อมูลพันธุกรรมให้แคบลง เพื่อให้ “โดโดเป็นโดโดให้มากที่สุด” ชาปิโรกล่าว 
และถ้าการทดลองนี้มีประสิทธิภาพมากพอก็อาจช่วยให้นักวิทยาศาสตร์สามารถย้ายลักษณะทางพันธุกรรมเฉพาะระหว่างนกแต่ละสายพันธุ์ เพื่อช่วยชีวิตพวกมันอีกด้วย เช่น การตัดต่อพันธุกรรมเพื่อให้พวกมันสามารถปรับตัวในสภาพแวดล้อมที่เป็นอันตรายหรือสภาพอากาศที่ร้อนขึ้น

อย่างไรก็ตาม มีหลายคนวิพากษ์วิจารณ์การใช้เงินจำนวนมหาศาล ราว 225 ล้านเหรียญ (7,395 ล้านบาท) เพื่อสนับสนุนให้คืนชีพให้นกโดโด เพราะคิดว่าทำไมไม่นำเงินไปใช้เพื่อปกป้องนกกว่า 400 สายพันธุ์ ตลอดจนสัตว์และพืชอื่นๆ อีกมากมายที่ถูกระบุว่ากำลังจะสูญพันธุ์

“มีหลายสิ่งหลายอย่างที่ต้องการความช่วยเหลือจากเรา ทำไมพวกคุณถึงต้องพยายามรักษาบางสิ่งที่หายไปแล้ว แทนที่จะช่วยสิ่งมีชีวิตที่ยังอยู่และต้องการความช่วยจากเราในตอนนี้” จูเลียน ฮูม (Julian Hume) นักบรรพชีวินวิทยานกชาวลอนดอนกล่าว
         
        </Text>
      </ScrollView>
    </View>
  
      
  );
}
const styles = StyleSheet.create({
  container:{
    flex: 1,
    marginTop: 50,
  },
  scrollViewContent:{
    margin: 5,
    padding:20,
    backgroundColor:'gray'
},
  text:{
    fontSize: 16,
    color: 'white'
}

})